app/controllers/pages_controller.rb

SELECT * FROM "pages" LIMIT 30 OFFSET 0
---
  def index
    @pages = Page.paginate(:all, :page => params[:page])

INSERT INTO "pages" ("permalink", "created_at", "title", "updated_at", "type", "view") VALUES('page-1', '2009-07-14 18:22:45', 'Page 1', '2009-07-14 18:22:45', 'Page', 'article')
---
  def create
    @page = Page.new(params[:page])
    @page.type = 'Page'
    if @page.save

SELECT * FROM "pages" WHERE ("pages"."id" = '1') LIMIT 1
---
  def edit
    @page = Page.find_by_id(params[:id])

SELECT * FROM "pages" WHERE ("pages"."id" = '1') LIMIT 1
UPDATE "pages" SET "updated_at" = '2009-07-14 18:13:55', "title" = 'Page 1 a' WHERE "id" = 1
---
  def update
    @page = Page.find_by_id(params[:id])
    if @page.update_attributes(params[:page])